#+title: Segundo Examen de Programación Lineal
#+author: Licenciatura en Matemáticas Aplicadas, UAEH
#+date: 23 de abril de 2019
#+language: es

#+options: toc:nil

#+latex_header: \usepackage[margin=2.5cm]{geometry}
#+latex_header: \usepackage[spanish,mexico]{babel}
#+latex_header: \usepackage{tikz}

#+latex_class_options: [twocolumn]

#+latex: \thispagestyle{empty}


#+latex: \hrulefill

#+latex: \medskip

1. Resuelve el siguiente problema:
   \begin{equation*}
   \begin{aligned}
   \text{Maximizar} \quad & 2x+y\\
   \text{sujeto a} \quad &
     \begin{aligned}
      4x+y &\leq 150\\
      2x-3y &\leq -40\\
      x &\geq  0\\
      y &\geq 0
     \end{aligned}
   \end{aligned}
   \end{equation*}
Veremos cómo se resuelve el problema usando =pulp=

#+begin_src ipython :session
from pulp import *

x2 = LpVariable("x2", 0)
y2 = LpVariable("y2", 0)
prob1 = LpProblem("problema1", LpMaximize)
prob1 += 4*x2 + y2 <= 150
prob1 += 2*x2 - 3*y2 <= -40
prob1 += 2*x2 + y2
status = prob1.solve()
value(y2),value(x2), value(prob1.objective)
#+end_src

#+RESULTS:
: # Out[1]:
: : (150.0, 0.0, 150.0)

2. Resuelve el siguiente problema:
   \begin{equation*}
    \begin{aligned}
   \text{Maximizar} \quad & 4x_{1}+2x_{2}\\
   \text{sujeto a} \quad &
     \begin{aligned}
      -2x_{1}+x_{2} &\leq 4\\
      x_{1}+2x_{2} &\geq 2\\
       x_{1} &\geq 0\\
       x_{2} &\geq 0
     \end{aligned}
   \end{aligned}
   \end{equation*}

Resolvamos 
#+begin_src python :session
from pulp import *
x = LpVariable("x", 0)
y = LpVariable("y", 0)
prob2 = LpProblem("problema2", LpMaximize)
prob2 += -2*x + y <= 4
prob2 += -1*x - 2*y <= -2
prob2 += 4*x + 2*y
status = prob2.solve()

value(y),value(x), value(prob2.objective)

#+end_src

#+RESULTS:
| 0.0 | 0.0 | 0.0 |

3. Resuelve el siguiente problema:
   \begin{equation*}
    \begin{aligned}
   \text{Maximizar} \quad & 5x_{1}+4x_{2}+3x_{3}\\
   \text{sujeto a} \quad &
     \begin{aligned}
      2x_{1}+3x_{2}+x_{3} &\leq 5\\
      4x_{1}+x_{2}+2x_{3} &\leq 11\\
      3x_{1}+4x_{2}+2x_{3} &\leq 8\\
       x_{1},x_{2},x_{3} &\geq 0
     \end{aligned}
   \end{aligned}
   \end{equation*}

#+begin_src python :session
from pulp import *
x3 = LpVariable("x3", 0)
y3 = LpVariable("y3", 0)
z3 = LpVariable("z3", 0)
prob3 = LpProblem("problema3", LpMaximize)
prob3 += 2*x3 + 3*y3 + z3 <= 4
prob3 += 4*x3 + y3 + 2*z3 <= -2
prob3 += 3*x3 + 4*y3 + 2*z3 <= 8
prob3 += 5*x3 + 4*y3 + 3*z3
status = prob3.solve()

value(y3),value(x3),value(z3) value(prob3.objective)

#+end_src

#+RESULTS:

4. Considera el subconjunto convexo \(P\) de \(\mathbb{R}^{2}\)
   determinado por las desigualdades:
   \begin{equation}
      \label{uno}
     \begin{split}
      x+2y &\leq 4\\
       x,y &\geq 0
     \end{split}
   \end{equation}
   - Para cada vértice \(v\) de \(P\), encuentra un vector \(c\) tal
     que el problema de maximizar \(f(x)=c^{T}x\) en la región \(P\)
     encuentre su única solución en \(v\).
   - Encuentra todas las soluciones factibles básicas de la forma
     estándar de un problema de programación lineal determinado
     por \eqref{uno}. 
   - Si \(P'\subseteq \mathbb{R}^{3}\) es la región factible de un
     problema de programación lineal determinado por \eqref{uno}, para
     cada vértice \(v\) de \(P'\), encuentra un vector \(c\) tal que
     el problema de maximizar \(f(x)=c^{T}x\) en la región \(P'\)
     encuentre su única solución en \(v\).
5. Un fabricante produce dos tipos de ropa: \(T_{1}\) y
   \(T_{2}\). Para producir una unidad de \(T_{1}\) se necesitan 4
   unidades de la materia prima \(R1\), 5 unidaes de materia prima
   \(R2\) y una unidad de la materia prima \(R3\). Para producir una
   unidad de \(T_{2}\) los requerimientos, en el mismo orden, son 1, 3
   y 2 unidades, respectivamente. Las cantidades disponibles de \(R1,
   R2\) y \(R3\) son: 56, 105 y 56, respectivamente.

   Si la ganancia de la venta de una unidad de \(T_{1}\) es de $4 y la
   de una unidad de \(T_{2}\) es $5, ¿cuánto se debe producir de
   \(T_{1}\) y \(T_{2}\) para maximizar las ganancias?
6. Una compañía que produce frutas mezcladas tiene en almacén 10,000
   kilos de peras, 12,000 kilos de duraznos y 8,000 kilos de
   cerezas. La compañía produce tres mezclas de frutas, que vende en
   latas de un kilo. La primera combinación contiene la mitad de peras
   y la mitad de duraznos. La segunda combinación contiene cantidades
   iguales de cada fruta. La tercera combinación tiene la mitad de
   duraznos y la mitad de cerezas. Las ganancias por lata vendida por
   cada combinación son de $3, $4 y $5 respectivamente. ¿Cuántas
   latas de cada combinación deberán producirse con el objeto de
   maximizar ganancias? ¿Cuál es la ganancia máxima?


